#!/bin/bash
# Скрипт контролює заповнення файлових систем

LIMIT=90  # мінімальний відсоток вільного місця

echo "Перевіряю стан дискового простору..."

# Беремо тільки відсоток використання та точку монтування
df -h --output=pcent,target | tail -n +2 | while read used mountpoint; do
  # Прибираємо знак % з числа
  used=${used%\%}

  # Якщо вільного місця менше, ніж LIMIT
  if [ "$used" -ge $((100 - LIMIT)) ]; then
    echo "ПОПЕРЕДЖЕННЯ: на розділі $mountpoint залишилося менше ${LIMIT}% вільного місця!"
  fi
done